[UI_TREE]
Machine=硬體設置
POWER=電源特性
TOUCH=腳踏設置

[IPG,CO2]
MPULSE_FREQ=維持脈衝頻率(khz)
MPULSE_RELS=維持釋放時間(us)

[IPG]
MO_DELAY_STEPS=MO延遲(us)
MODECHG_DELAY=模式切換延時(ms)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE=進入對話方塊電流取值
WORK_CURRENT_TYPEOption=第0層電流|設定值
WORK_CURRENT=設定工作電流(A)

[ALL]
SAFE_DOOR=安全門保護
SAFE_DOOROption=無效|暫停|中止
MARKEND_SCAN=打標結束振鏡位置
MARKEND_SCANOption=原點|左上角|頂部中心位置|右上角|右側中心處|右下角|底部中心位置|左下角|左側中心位置|自定義位置
MARKEND_X=自定義時X座標(mm)
MARKEND_Y=自定義時Y座標(mm)

[SCAN]
PREHEAT_ENABLE=振鏡是否需要預熱
PREHEAT_ENABLEOption=否|是
PREHEAT_TIME=最小預熱時間(分)
USE_LIMIT_JUMPDELAY=是否啓用跳轉延時
USE_LIMIT_JUMPDELAYOption=否|是
LIMIT_JUMPLEN=限制跳轉距離(mm)
LIMIT_JUMPDELAY_MM=每mm跳轉時間(us)

[BitmapPower]
BitmapPower=灰度點陣圖打標
AUT_TIME=衰減時間(us)
AUT_COFF=增益係數(0-1)

[Signal]
Signal=信號設置
Cycle=觸發幾次有效
MARK_CNT=一次打標命令打標幾次
DELAY=觸發後延時(ms)
DLY_BETWEEN_MARK=兩次打標之間延時(ms)
MARK_END_DELAY=打標完成後延時(ms)
MARK_END_PULSE_W=打標結束信號長度(ms)
B_MARK_ONCE=觸發模式
B_MARK_ONCEOption=電平觸發|邊沿觸發
Enable_Loop_Mdt=脫機後迴圈打標
Enable_Loop_MdtOption=不啟用|啟用
IOSELCOUNT=I/O選文檔信號數
ENABLE_CARDTOUCH=下位機觸發
ENABLE_CARDTOUCHOption=不啟用|啟用


[UI_FACE]
ExportSysPara =導出參數...
ImportSysPara =導入參數...
Ok=確定
Cancel=取消
Apply=應用

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]
0=雷射器硬體參數設置嚮導
1=上一步
2=下一步
3=保存
4=取消

[DIALOG_POWER]
0=第二步：設定您所選雷射器的硬體設定
1=電流調節範圍(%)
2=最小電流(%)：
3=最大電流(A)：
4=類比Q驅
5=數位Q驅
6=Q驅類型
7=電源類型
8=CO2雷射器功率大小
9=普通電源
10=快速回應電源
11=大於或等於100W
12=小於100W
13=維持脈衝設定
14=頻率（KHZ）
15=釋放時間（us）
16=空閒電流(%)：
17=最大占空比
18=補償電流(%)
19=雷射器硬體設定
20=M值設定
21=M值：
22=調整係數：
23=正常
24=過大
25=過小

[DIALOG_MODEL]
0=第四步：根據您的喜好，選擇您喜歡的控制管道
1=一種全新的控制管道，操作簡單，使用者不需設定任何延時，但只能在部分雷射器上使用。
2=傳統雷射控制管道，符合大多數人的使用習慣，所有雷射器都能使用此管道。
3=簡便模式
4=傳統模式
5=雷射打標控制模式
6=方頭類型
7=單頭模式
8=雙頭模式

[DIALOG_LaserType]
0=激光器類型:
1=YAG雷射器
2=DP雷射器
3=紫外雷射器
4=CO2雷射器
5=調Q光纖雷射器
6=SPI雷射器
7=LD雷射器
8=YLPM（HFM-H）雷射器
9=YLP-V2雷射器
10=YLPP雷射器
11=HFM-A雷射器
12=HFM-P雷射器
13=HFM-R雷射器
14=HFM-J雷射器
15=MOPA可調脈寬雷射器
16=連續光纖雷射器
17=超快雷射器

[DIALOG_CONTENT]
0=第五步：恭喜您，您的設置已經全部完成，請保存相關蓡數

[LaserType_Explain]
0=YAG激光器
1=DP激光器
2=紫外激光器
3=CO2激光器
4=調Q光纖激光器
5=SPI激光器
6=LD激光器
7=MoPa光纖激光器
8=YLP-V2激光器
9=YLPP激光器
10=HFM-A激光器
11=HFM-P激光器
12=HFM-Q激光器
13=HFM-J激光器
14=other

[Model_Explain]
0=CO2 簡便模式
1=CO2 傳統模式
2= 調Q、普通電源+數字Q 傳統模式
3= 調Q、普通電源+模擬Q 傳統模式
4= 調Q、快速響應電源+數字Q 傳統模式
5= 調Q、快速響應電源+模擬Q 傳統模式
6= 調Q、普通電源+模擬Q 簡便模式
7= 調Q、快速響應電源+數字Q 簡便模式
8= 調Q、快速響應電源+模擬Q 簡便模式
9= IPG 模式
10=SPI 簡便模式
11=SPI 傳統模式
12=LD 模式
13=YLPM(HFM-H) 傳統模式
14=YLPM(HFM-H) 簡便模式
15=YLP-V2 傳統模式
16=YLP-V2 簡便模式
17=YLPP 傳統模式
18=YLPP 簡便模式
19=HFM-A 傳統模式
20=HFM-A 簡便模式
21=HFM-P 傳統模式
22=HFM-P 簡便模式
23=HFM-R 傳統模式
24=HFM-R 簡便模式
25=HFM-J 傳統模式
26=HFM-J 簡便模式

[DIALOG_ScanType]
0=第三步: 設置振鏡類型
1=自制振鏡
2=其它振鏡
3=提示:請正確選擇機器對應的振鏡類型, 自制振鏡上電後需要預熱才能正常工作,其它振鏡無需預熱
;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0 = 停止加工輸入端口
STATIC_1 = 停止加工輸出端口
STATIC_2 = 輸出端口
STATIC_3 = 安全門
STATIC_4 = 輸入端口
STATIC_5 = 激光器準備好輸出口
STATIC_6 = 輸入端口
STATIC_7 = 輸出端口
STATIC_8 = 軟件就緒輸出口
STATIC_9 = 輸出端口
STATIC_10 = 激光電源輸出口
STATIC_11 = 端口
STATIC_12 = 外部紅光指示輸出
STATIC_13 = 輸出端口
STATIC_14 = 輸入端口
STATIC_15 = 打標伴隨
STATIC_16 = 輸出端口
STATIC_17 = 標刻結束輸出口
STATIC_18 = 輸出端口
STATIC_19 = 脈沖寬度
STATIC_20 = 光纖激光器報警輸出口
STATIC_21 = 輸出端口
STATIC_22 = 開始標刻端口
STATIC_23 = 輸入端口
IDC_CHECK_LASERWARN = 檢測激光器報警
IDC_CHECK_PLUSE_REVERSE = Q信號電平反轉
IDC_RADIO_NORMAL =標準
IDC_RADIO_BICOLORLAMP =雙色燈
IDC_RADIO_TRICOLORLIGHT =三色燈

[error]
1=卡未初始化或找不到卡!
2=復位失敗!
3=卡版本不對!
4=報警!
6=執行失敗!
7=狀態不對應!
16=命令超時!
17=命令丟失!
18=接口調用不同步!
19=接口被其他程式佔用!
20=Z軸超限或校正文件損壞!
21=參數不匹配!
23=記憶體分配失敗!
100=脫機使用中!
101=命令被中止!
1001=端口1
1002=端口2
1003=端口3
1004=端口4
1005=端口5
1006=端口6
1007=端口7
1008=激光輸入沒有準備好
1009=激光輸入準備就緒

;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

；--------------------------------- BEGIN: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG=雷射器設定
IDD_PROPPAGE_POWER=電源特性
IDD_PROPPAGE_SYS_SET=硬體設定
IDD_PROPPAGE_TOUCH=脚踏設定
IDD_PORT_SET =埠設定

[IDD_DIALOG_HANSLASERSET]
CAPTION =系統設置
IDC_BTN_SAVE=保存
IDCANCEL=退出
LISTTITLE_NAME=項名稱
LISTTITLE_VALUE=值
；--------------------------------- END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------


